---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.FlowDirection
source: html/3b95d9e4-d12f-121d-3e33-4209fa3d8c52.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.FlowDirection Property

The flow direction of this connector, In or Out.

## Syntax (C#)
```csharp
public FlowDirectionType FlowDirection { get; }
```